{
  "title": "welcome",

  "mainCV": {
    "description": "I am a Full Stack engineer with experience in data automation, analysis, and processing. I have developed solutions that optimize the collection and treatment of information using machine learning, significantly improving system efficiency. While I also have experience with databases, my greatest strength lies in the automation and optimization of complex processes. Throughout my career, I have handled all the tasks typical of a Full Stack developer, from database management, API testing with Postman, to creating unit and automated tests with tools like Selenium and unit testing. My comprehensive approach ensures that every part of the system, from the back-end to the front-end, works optimally and efficiently. Additionally, I have developed innovative solutions by integrating hardware such as Raspberry Pi and Arduino to enhance data collection in systems, always seeking ways to automate and improve processes."
  },
  "school01": {
    "title": "Education",
    "description": "I completed my high school education at the Polytechnic School of the National Polytechnic Institute (IPN), Cecyt 14, focused on the field of computer science. Later, I continued my university studies at the Superior School of Mechanical and Electrical Engineering (ESIME) of IPN, obtaining a degree in Computer Engineering. During my time at ESIME, I not only expanded my knowledge in computer science but also gained a solid foundation in electronics and mechanics. As part of my extracurricular activities, I participated in the ASME (American Society of Mechanical Engineers) club, where I had the opportunity to work with welding tools and other specialized equipment, allowing me to develop unconventional automobiles as part of personal projects. Additionally, during my social service at the university, I contributed to improving the management of schedules and classrooms by implementing a system based on QR codes, making the process of reassigning spaces more efficient.",
    "timeTitle": "Time:",
    "time": "2014 — 2019",
    "images": [
      "assets/imgObj/weld02.jpg",
      "assets/imgObj/weld03.jpg",
      "assets/imgObj/board01.jpg"
    ]
  },
  "school02": {
    "title": "QR Codes for Scheduling",
    "description": "During my university social service, I designed and implemented a QR code system to optimize schedule management and classroom assignments. The main goal was to eliminate paper usage in classrooms, providing students and teachers with immediate and up-to-date access to class schedules through a simple QR code scan. Each code was linked to a specific URL that redirected to a corresponding virtual classroom, allowing real-time schedule viewing. This system presented several advantages, such as the flexibility to make last-minute updates or changes to the schedules without needing to print new versions. Additionally, the implementation of QR codes led to greater efficiency in classroom management, ensuring that all users had access to the most recent information without paper waste or manual revisions. The digitalization of schedules not only facilitated communication between students and administration but also contributed to a more eco-friendly and modern solution for resource management in the school.",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/HTML5.svg", "assets/mySVGs/JSON.svg"]
  },
  "school03": {
    "title": "Thesis Project",
    "description": "I developed a security system using Arduino, integrating biometric sensors such as a fingerprint scanner and a heart rate sensor. The idea behind the project was to create a personalized user profile by recording the pulse and comparing it to previous values to ensure the vehicle couldn't be started by third parties, providing greater control and protection against potential theft. The system included the design, coding, and connection of key motorcycle components, such as the relay and electric starter motors. The goal was for only the registered user to activate the vehicle. However, during development, there were difficulties with the heart rate sensor, as the results varied greatly depending on the environment and the user's conditions, making the system unreliable for real-life use. This issue concluded that, although the prototype achieved its basic functionality, the practical application of heart rate as a security method was not feasible due to its inaccuracy and lack of stability in various situations.",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
      "assets/imgObj/proto01.jpg",
      "assets/imgObj/proto02.jpg"
    ]
  },
  "school04": {
    "title": "English Language",
    "description": "My English studies began in 2010, starting from the basic B1 level. Thanks to my interest in video games and my affinity for rock/metal music, I found it easy to progress quickly. Additionally, I studied at Harmon Hall, a school outside of my university curriculum, which reinforced my language learning. In 2012, I obtained my first official certification, and in 2014, I achieved the second certification required to complete my high school education. Finally, in 2022, I earned the certification necessary to fulfill the language requirements for my university degree."
  },
  "stupidFriendly": {
    "title": "Software Engineering Intern",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/HTML5.svg",
    "assets/mySVGs/Microsoft SQL Server.svg",
    "assets/mySVGs/Bootstrap.svg",
    "assets/mySVGs/BitBucket.svg",
    "assets/mySVGs/Django.svg"],
    "techtack": ["Languages and Frameworks: Python (TurboGears 2.0), JavaScript (jQuery 1.7), HTML, CSS", "Database: MySQL 5.5", "Tools: jQuery for Front-End, MySQL Workbench, TurboGears for Backend development"],
    "dutiesTitle": "Responsibilities:",
    "duties": ["Documentation of inventory pages, distribution, and an external platform for ticket sales and distribution", "Collaboration in the creation and maintenance of APIs for data management using Python (TurboGears) and JavaScript (jQuery).", "Identifying and resolving system reliability issues."],
    "timeTitle": "Time:",
    "time": "2014 July — 2016 Dec"
  },
  "Infotec":
  {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/NETcore.svg", "assets/mySVGs/Bootstrap.svg", "assets/mySVGs/GitHub.svg", "assets/mySVGs/HTML5.svg"],
    "techtack": ["Lenguajes y Frameworks: .NET Framework 4.7.x, .NET Core 2.x, JavaScript (ES6), Angular 6.", "Base de Datos: MySQL 5.7.", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017."],
    "descTitle": "Descripción:",
    "description": "Participé en el desarrollo de dos proyectos web enfocados en la administración de usuarios y la creación de citas, lo que contribuyó significativamente a la funcionalidad y el alcance de las aplicaciones.",
    "dutiesTitle": "Responsabilidades:",
    "duties": ["Implementación de eventos en el Front-End y seguimiento de la lógica de eventos hasta la base de datos.", "Resolución de problemas y mantenimiento del sistema, incluyendo la identificación y solución de errores.", "Comunicación continua con los usuarios iniciales para recolectar retroalimentación y definir nuevas funcionalidades junto con el equipo de QA."],
    "timeTitle": "Time:",
    "time": "2019 Feb — 2021 Sep"
  },
  "Semovi": {
    "title": "Software Engineer",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/Bootstrap.svg", "assets/mySVGs/GitHub.svg", "assets/mySVGs/HTML5.svg"],
    "techtack": ["Languages and Frameworks: Laravel, JavaScript (ES6)", "Database: MySQL 5.7.", "Tools: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017."],
    "descTitle": "Description:",
    "description": "During my time at SEMOVI, I was contracted for a 3-month period to work on a project linked to the Ministry of Foreign Affairs (SRE), as both institutions used the same technology stack. My main role involved speeding up the resolution and cleaning of bugs on a page dedicated to appointment scheduling. I used tools like Postman to verify data integrity and find system errors, which significantly improved platform performance and optimized its overall efficiency.",
    "timeTitle": "Time:",
    "time": "2019"
  },
  "FletesTransportes":
  {
    "title": "Junior Software Engineer",
    "techTitle": "Technologies used:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/Android.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/Bootstrap.svg",
      "assets/mySVGs/GitHub.svg",
      "assets/mySVGs/HTML5.svg"
    ],
    "techtack": ["Languages & Frameworks: Kotlin 1.4, SQLite 3.35, Retrofit 2.9, .NET Core 3.1, .NET Core 2.x, JavaScript (ES6), Angular 6, Node Express 4", "Database: MySQL 5.7", "Tools: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 & 2019, phpMyAdmin 4.0"],
    "descTitle": "Description:",
    "description": "I actively participated in and led a variety of projects across different areas of development and business solutions. Key contributions include the creation of a virtual kiosk, a comprehensive tool that allowed employees to access and view information like trips, vacations, and bonuses. Additionally, I led an Android project aimed at simplifying inventory management for Tractocamiones, providing details about the state of their components, such as seats, tires, and other key elements. I also spearheaded the creation of a merchandise management program designed to clean and process customer data, ensuring only essential information for billing was maintained. Furthermore, I developed a web panel for the monitoring area, offering a detailed view of travel data, including start and end points, routes, emergency buttons, and engine stops, among other critical functions.",
    "dutiesTitle": "Responsibilities:",
    "duties": ["Defined and established the architecture of the merchandise management project, ensuring a scalable design that met business objectives.",
    "Implemented advanced data cleaning and validation techniques, including the use of regular expressions, to ensure data integrity.",
    "Developed algorithms using machine learning to extract key information from complex data sets, such as Excel sheets with variable formats.",
    "Optimized system architecture using established technologies and protocols (FTP) to facilitate efficient data exchange across departments.",
    "Designed and implemented a web version of the application following SOLID principles using .NET and Angular.",
    "Performed continuous system maintenance and proactive error identification, including dependency management to ensure system stability.",
    "Defined the structure of the Android inventory project, integrated APIs using Retrofit, and implemented data storage with SQLite.",
    "Handled threads and concurrency using Kotlin Coroutines, optimized performance by resolving bottlenecks, and ensured compatibility with Android updates.",
    "Developed and applied logic for extracting critical data for fleet management, monitoring events like unauthorized stops, and emergency alerts."],
    "methodologiesTitle": "Methodologies:",
    "methodologies": ["Applied Agile methodologies (Scrum) in all projects, working in sprints to implement improvements based on continuous feedback.", "Collaborated with cross-functional teams to ensure smooth communication and timely project deliveries."],
    "achivementTitle": "Achievements:",
    "achivemens": ["Ms", "Mejorar tiempo de bla bla"],
    "timeTitle": "Time:",
    "time": "2021 May — 2024 July"
  },
  "FletesTransportes01": {
    "title": "Junior Software Engineer",
    "techTitle": "Technologies used:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/GitHub.svg"
    ],
    "techtack": ["Languages and Frameworks: .NET Core 3.1", "Database: MySQL 5.7", "Tools: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 and 2019"],
    "descTitle": "Description:",
    "description": "Led the creation of a goods management program designed to clean and process client data, ensuring that only essential information for billing was retained.",
    "dutiesTitle": "Responsibilities:",
    "duties": [
      "Defined and established the architecture of the goods management project, ensuring a scalable design that met business objectives.",
      "Implemented advanced data cleaning and validation techniques, including the use of regular expressions to ensure data integrity.",
      "Developed algorithms using machine learning to extract key information from complex datasets, such as Excel sheets with variable formats."
    ],
    "methodologiesTitle": "Methodologies:",
    "methodologies": [
      "Applied Agile methodologies (Scrum) in all projects, working in sprints to implement improvements based on continuous feedback.",
      "Collaborated with cross-functional teams to ensure smooth communication and timely project deliveries."
    ],
    "achievementTitle": "Achievements:",
    "achievements": ["Increased the volume of goods processed from smaller clients by 30%."],
    "timeTitle": "Time:",
    "time": "May 2021 — July 2024"
  },
  "FletesTransportes02": {
    "title": "Junior Software Engineer",
    "techTitle": "Technologies used:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/Android.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/GitHub.svg"
    ],
    "techtack": ["Languages and Frameworks: Kotlin 1.4, SQLite 3.35, Retrofit 2.9, .NET Core 3.1, .NET Core 2.x, JavaScript (ES6), Angular 6, Node Express 4", "Database: MySQL 5.7", "Tools: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 and 2019"],
    "descTitle": "Description:",
    "description": "Led a key project aimed at modernizing the storage and registration system for heavy trucks, which previously operated with a desktop program developed in .NET. The goal was to create a more efficient solution, developing an API in C# and an Android application that allowed for sending and receiving data in JSON format, along with photos of vehicle components such as tires, gas tanks, and mirrors. The update brought multiple advantages, including the automatic registration of components requiring replacement. This information was stored in the unit’s profile, enabling further analysis and alerts for preventive or corrective maintenance, such as tire replacement or scheduling a technical stop. The system also optimized operational costs by replacing tablets, priced at approximately $500 USD, which was significantly cheaper than maintaining rugged devices worth $4000 USD. This implementation not only streamlined truck maintenance but also enhanced data collection and analysis, speeding up processes when arriving or leaving the yards.",
    "dutiesTitle": "Responsibilities:",
    "duties": [
      "Define the structure of the Android inventory project, integrate APIs using Retrofit, and implement data storage with SQLite.",
      "Manage threads and concurrency using Kotlin Coroutines, optimizing performance and resolving bottlenecks while ensuring compatibility with Android updates.",
      "Project Planning and Architecture.",
      "System Connections and Communication.",
      "Database and Information Storage.",
      "Creation of Tests and API Integration.",
      "System Optimization for the End User."
    ],
    "methodologiesTitle": "Methodologies:",
    "methodologies": [
      "Applied Agile methodologies (Scrum) in all projects, working in sprints to implement improvements based on continuous feedback.",
      "Collaborated with cross-functional teams to ensure smooth communication and timely project deliveries."
    ],
    "achievementTitle": "Achievements:",
    "achievements": ["The system also optimized operational costs by replacing tablets, priced at approximately $500 USD, which was significantly cheaper than maintaining rugged devices worth $4000 USD. This implementation not only streamlined truck maintenance but also improved data collection and analysis efficiency, speeding up processes when arriving or leaving the yards."],
    "timeTitle": "Time:",
    "time": "May 2021 — July 2024"
  },
  "FletesTransportes03": {
    "title": "Junior Software Engineer",
    "techTitle": "Technologies used:",
    "tech": [
      "assets/mySVGs/Microsoft SQL Server.svg"
    ],
    "techtack": ["Database: MySQL 5.7", "Tools: SQL Server Management Studio (SSMS) 2017 and 2019"],
    "descTitle": "Description:",
    "description": "Developed a web dashboard for the monitoring department, offering a detailed view of travel data, including start and end points, routes, emergency buttons, engine stops, and other critical functions.",
    "dutiesTitle": "Responsibilities:",
    "duties": [
      "Created and optimized complex SQL queries to extract real-time data on vehicle positioning, current routes, and travel history.",
      "Applied optimization techniques such as indexes and table partitioning to ensure that large-scale queries ran efficiently, even with high data volumes.",
      "Conducted continuous system maintenance and proactively identified errors, including managing dependencies to ensure system stability.",
      "Developed and applied logic for extracting critical data for fleet management, monitoring events like unauthorized stops and emergency alerts."
    ],
    "methodologiesTitle": "Methodologies:",
    "methodologies": [
      "Applied Agile methodologies (Scrum) in all projects, working in sprints to implement improvements based on continuous feedback.",
      "Collaborated with cross-functional teams to ensure smooth communication and timely project deliveries."
    ],
    "timeTitle": "Time:",
    "time": "May 2021 — July 2024"
  },
  "pp01": {
    "title": "Two-Stroke Bike-Motor",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
      "assets/imgObj/weld01.jpg",
      "assets/imgObj/bici01.jpg",
      "assets/imgObj/bici02.jpg"
    ],
    "descTitle": "Description:",
    "description": "I developed a bike-motor from scratch by modifying the original bicycle frame to integrate a two-stroke combustion engine. I implemented electronic components such as the CDI and a biometric ignition system using Arduino. The system utilized two sensors—a heart rate monitor and a fingerprint reader—to ensure that only the authorized user could start the engine, integrating the system with the motorcycle's starter components."
  },
  "pp02": {
    "title": "Four-Stroke Bike-Motor",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
      "assets/imgObj/weld01.jpg",
      "assets/imgObj/bici03.jpg"
    ],
    "descTitle": "Description:",
    "description": "I upgraded the project by replacing the two-stroke engine with a four-stroke engine, improving the vehicle's efficiency and performance. This change required adjustments to the biometric ignition system, maintaining the fingerprint sensor but optimizing motor control to fully utilize the capabilities of the new engine."
  },
  "pp03": {
    "title": "Automated Tinder with Selenium",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/Selenium.svg", "assets/mySVGs/CSharp.svg"],
    "descTitle": "Description:",
    "description": "I developed a project in C# using Selenium to automate interactions on a social media platform. This system can log in, like profiles, browse photos, read descriptions, gather data on preferences or interests to start conversations, dislike profiles, and initiate conversations automatically. However, a key limitation is that it cannot autonomously understand or respond to emergent or personalized conversations, restricting interaction to basic automated processes."
  },
  "pp04": {
    "title": "Mask with Raspberry Pi",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Description:",
    "description": "I developed a project using a Raspberry Pi programmed in Python with OpenCV to detect and process eye movements through a camera. The eye movements (left, right, up, down, and blinks) were sent to an Arduino that controlled an LED module (MAX7219), simulating these movements on an LED matrix. I also implemented a microphone to recognize voice tone and encode it into an 8x128 LED matrix. Additionally, I designed the necessary boards to support the module and expand the matrix to 32x128 LEDs, all integrated with precise control over eye movement."
  },
  "pp05": {
    "title": "Automatic Turret with Raspberry Pi",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Description:",
    "description": "I developed an automatic turret using a Raspberry Pi, servomotors, and Python with OpenCV to track QR codes. The system utilized a camera to detect the QR code and process the image, adjusting the servomotors to precisely point at the code. Once aligned, a laser was activated, pointing directly at the QR code. Additionally, I implemented a hit counter that recorded the number of times the system successfully aimed at the target."
  },
  "pp06": {
    "title": "Security Camera with Raspberry Pi",
    "techTitle": "Technologies used:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Description:",
    "description": "I developed a security system using a Raspberry Pi with a camera and Python along with OpenCV for QR code tracking. The initial project involved detecting movements and triggering an alarm in case of suspicious activity, functioning as a basic security system. This proposal has the potential to scale by adding advanced object detection capabilities for dangerous items like knives, weapons, or other threats, using real-time object recognition algorithms, thereby improving the system's precision and ability to react to risk situations."
  },
  "pp07": {
    "title": "Juego para celular",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/CSharp.svg", "assets/mySVGs/Unity.svg", "assets/mySVGs/JSON.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un juego para celular tipo runner en Unity utilizando C#. El juego incluye cuatro niveles con una dificultad progresiva, en los que cambian la velocidad de los enemigos y los obstáculos en cada mapa. Los assets fueron creados en Blender, y el juego cuenta con una integración a través de una API en C# para guardar y consultar los puntajes en una base de datos en SQL. El juego fue publicado en la Play Store de Android, aunque posteriormente fue retirado de la plataforma."
  },
  "curso01": {
    "title": "ANGULAR and ASP.NET Core REST API - Real World Application.",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/CSharp.svg", "assets/mySVGs/Angular.svg", "assets/mySVGs/JSON.svg"],
    "techtack": ["Instructor: Sameer Saini"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Angular CLI", "Angular Components", "Angular Routing", "Angular Services", "HTTP calls", "CORS",
      "Use Bootstrap CSS in Angular applications", "Create reusable components", "CRUD operations (Create Read Update Delete)",
      "Angular Forms", "Live Markdown Preview", "Markdown to HTML", "Angular Form Elements",
      "Authentication and Authorization", "JWT Tokens and Storage", "Cookie Services", "Local Storage",
      "Interceptors", "Auth/Route Guards", "Image Upload in Angular applications", "Models and Interfaces",
      "Create ASPNET Core APIs from scratch using C#", "Create endpoints and action methods",
      "CRUD operations in ASP.NET Core (Create Read Update Delete)", "Install and Use Entity Framework Core to connect to SQL Server database",
      "Understand and implement Entity framework core relationships", "Domain-Driven Design Patterns (DDD)", "Repository Pattern in ASP.NET Core",
      "Domain Modelling", "Entity Framework Code First Approach", "SQL Server", "Seeding the Database", "HTTP Web Methods",
      "Authentication and Authorization", "JWT Tokens", "Role Based Authorization", "Image Upload in ASP.NET Core Web API",
      "Write Clean, Re-Usable Code"
    ]
  },
  "curso02": {
    "title": "Node: De cero a experto.",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/node01.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/GitHub.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": [
      "SocketIO", "JWT", "Git", "GitHub", "JSON", "Google Services", "Google APIs", "Heroku", "MySQL", "TypeScript",
      "PostMan", "Express", "YARGS", "Aplicaciones de consola básicas e interactivas", "Mongo Compass", "Paquetes", "NPM",
      "RESTServer", "Socket Server", "Consumo de servicios", "Creación de archivos", "Despliegues"
    ]
  },
  "curso03": {
    "title": "JavaScript Moderno: Guía para dominar el lenguaje.",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/GitHub.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Bases de JavaScript", "Tipos de datos", "Objetos", "Operadores", "Ciclos", "ESNext", "Clases", "Propiedades privadas",
      "Node", "Npm", "Instalación de paquetes en proyectos de JavaScript", "Promesas", "Callbacks", "CRUD",
      "Modals manuales", "Carga de archivos", "Fetch", "Funciones generadoras", "Vite", "Mappers",
      "JSDocs y documentación de funciones", "VSCode con tipos de datos en JavaScript", "Manipulación del DOM"
    ]
  },
  "curso04": {
    "title": "Angular: De cero a experto.",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/Angular.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Bases de TypeScript y ESCMAScript", "Hola Mundo en Angular", "Componentes", "Directivas", "Servicios", "Módulos",
      "Todos los pipes de Angular", "Rutas", "Rutas Hijas", "Carga perezosa o Lazyload de módulos", "Guards", "Protección de rutas",
      "Autenticación mediante JsonWebTokens", "Mapas", "Uso de librerías de terceros escritas en Angular", "Uso de librerías NO escritas para Angular",
      "Consumo de APIs", "CRUD", "SPA", "Git", "GitHub", "Despliegues a producción", "MongoDB", "Node",
      "Re-utilización de componentes, directivas, servicios", "Comunicación entre componentes y módulos", "Uso de extensiones reactivas",
      "PrimeNG", "Material Design", "Bootstrap", "Tailwind", "Defer", "Triggers", "Signals", "Writable Signals", "Computed Signals"
    ]
  },
  "curso05": {
    "title": "Principios SOLID y Clean Code",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/TypeScript.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": [
      "S – Single Responsibility Principle (SRP)", "O – Open/Closed Principle (OCP)", "L – Liskov Substitution Principle (LSP)",
      "I – Interface Segregation Principle (ISP)", "D – Dependency Inversion Principle (DIP)"
    ]
  },
  "curso06": {
    "title": "Curso completo programación C# en .Net",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/CSharp.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/NETcore.svg"],
    "techtack": ["Instructor: Alberto Picazo"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Inicialización a SQL Server", "Iniciación a Entity Framework Core", "Clean Code", "Iniciación a Azure",
      "Principios SOLID", "Principios API REST", "Conceptos de Inyección Dependencias en .Net Core",
      "Creación de API de .Net Core desde cero", "OpenApi / Swagger en proyectos de API de .Net Core",
      "HttpClientFactory en Net Core 2.1+"
    ]
  },
  "curso07": {
    "title": "Docker, de principiante a experto",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/Docker.svg"],
    "techtack": ["Instructor: Ricardo Andre Gonzalez Gomez"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Imágenes", "Contenedores", "Volúmenes", "Redes", "Docker Compose", "Docker Registry"
    ]
  },
  "curso08": {
    "title": "Android Retrofit 2 complete course in Kotlin",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/Android.svg"],
    "techtack": ["Instructor: Catalin Stefan"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Basic Retrofit implementation", "Logging", "URL resolution", "GET, POST and other request methods", "Queries",
      "URL manipulation", "Request body", "Sending form data", "Headers", "Canceling requests",
      "Caching", "Pagination", "Synchronous vs asynchronous communications", "Retrofit with RxJava", "Authentication"
    ]
  },

  "SRE":
  {
    "title": "Des Sr",
    "tech": ["assets/mySVGs/wrench01.svg", "assets/mySVGs/cubes01.svg"],
    "techtack": ["dotNet 5.0", "node express 3.8"],
    "description": " lorem ipsum dolor sit amet",
    "achivement": "llorem ipsum dolor sit amet"
  }
}
