{
  "title": "Bienvenidos",

  "menu3dScene": {
    "mainTitle": "Menu",
    "subDiv01": "FullStack-Dev",
    "subDiv02": "Formación Académica",
    "subDiv03": "Proyectos Personales y Habilidades Técnicas",
    "subDiv04": "Cursos Online",
    "subDiv05": "Idiomas"
  },

  "FullStackExp": {
    "mainTitle": "Becario Full stack",
    "subDiv01": "2014-2016",
    "subDiv02": "2019-2021",
    "subDiv03": "C# 2021-2024",
    "subDiv04": "ML 2021-2024",
    "subDiv05": "Android 2021-2024",
    "subDiv06": "SQL 2021-2024"
  },

  "SchoolEd": {
    "mainTitle": "Educación",
    "subDiv01": "Serv. Social",
    "subDiv02": "Proy Titulación",
    "subDiv03": "Idioma Inglés"
  },

  "PersonalP": {
    "mainTitle": "Bici-moto 2 tiempos",
    "subDiv01": "Bici-moto 4 tiempos",
    "subDiv02": "Selenium",
    "subDiv03": "Máscara en Raspberry Pi",
    "subDiv04": "Torreta en Raspberry Pi",
    "subDiv05": "Cámara de seguridad en Raspberry Pi",
    "subDiv06": "Juego para celular"
  },

  "cursos0": {
    "mainTitle": "ANGULAR and ASP.NET",
    "subDiv01": "Node",
    "subDiv02": "JavaScript Moderno",
    "subDiv03": "Angular",
    "subDiv04": "SOLID",
    "subDiv05": "C# en .Net",
    "subDiv06": "Docker",
    "subDiv07": "Android Retrofit",
    "subDiv08": "Android Kotlin",
    "subDiv09": "SQL",
    "subDiv10": "Blender 2.9",
    "subDiv11": "Three.js and TypeScript"
  },

  "mainCV":
  {
    "description": "Soy un ingeniero Full Stack con experiencia en la automatización, análisis y procesamiento de datos. He desarrollado soluciones que optimizan la recolección y tratamiento de información utilizando machine learning, aportando mejoras significativas en la eficiencia de los sistemas. Aunque también tengo experiencia en bases de datos, mi mayor fortaleza reside en la automatización y optimización de procesos complejos. A lo largo de mi carrera, he manejado todas las tareas propias de un desarrollador Full Stack, desde la gestión de bases de datos, pruebas de APIs con Postman, hasta la creación de pruebas unitarias y automatizadas con herramientas como Selenium y unit testing. Mi enfoque integral me permite asegurar que cada parte del sistema, desde el back-end hasta el front-end, funcione de manera óptima y eficiente. Además, he desarrollado soluciones innovadoras integrando hardware como Raspberry Pi y Arduino para mejorar la obtención de datos en sistemas, siempre buscando formas de automatizar y mejorar procesos."
  },
  "school01":
  {
    "title": "Educacion",
    "description": "Completé mi educación de bachillerato en la escuela politécnica del Instituto Politécnico Nacional (IPN), Cecyt 14, enfocada en el área de informática. Posteriormente, continué mis estudios universitarios en la Escuela Superior de Ingeniería Mecánica y Eléctrica (ESIME) del IPN, obteniendo el título de Ingeniero en Computación. Durante mi tiempo en ESIME, no solo amplié mis conocimientos en informática, sino que también adquirí una sólida base en electrónica y mecánica. Como parte de mis actividades extracurriculares, participé en el club ASME (American Society of Mechanical Engineers), donde tuve la oportunidad de trabajar con herramientas de soldadura y otros equipos especializados, lo que me permitió desarrollar automóviles no convencionales como parte de proyectos personales. Además, durante mi servicio social en la universidad, contribuí a mejorar la gestión de horarios y salones mediante la implementación de un sistema basado en códigos QR, facilitando el proceso de reasignación de espacios de manera más eficiente.",
    "timeTitle": "Time:",
    "time": "2014 — 2019",
    "images": [
     "assets/imgObj/weld02.jpg",
     "assets/imgObj/weld03.jpg",
     "assets/imgObj/board01.jpg"]
  },
  "school02":
  {
    "title": "Codigos Qr Horarios",
    "description": "Durante mi servicio social en la universidad, diseñé e implementé un sistema de códigos QR para optimizar la gestión de horarios y la asignación de salones. El objetivo principal fue eliminar el uso de papel en los salones, proporcionando a los estudiantes y profesores acceso inmediato y actualizado a los horarios de clases mediante un simple escaneo de los códigos QR. Cada código estaba vinculado a un enlace específico que redirigía a un salón virtual correspondiente, lo que permitía la visualización del horario en tiempo real. Este sistema presentó varias ventajas, como la flexibilidad para realizar actualizaciones o cambios de última hora en los horarios sin necesidad de imprimir nuevas versiones. Además, la implementación de los códigos QR permitió una mayor eficiencia en la gestión de los salones, asegurando que todos los usuarios tuvieran acceso a la información más reciente, sin el desperdicio de papel ni la necesidad de revisiones manuales. La digitalización de los horarios no solo facilitó la comunicación entre los estudiantes y la administración, sino que también contribuyó a una solución más ecológica y moderna para la gestión de recursos en la escuela.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/HTML5.svg", "assets/mySVGs/JSON.svg"]
  },
  "school03":
  {
    "title": "Proyecto de titulacion",
    "description": "Desarrollé un sistema de seguridad utilizando Arduino, integrando sensores biométricos como el de huella digital y un sensor de pulso cardíaco. La idea detrás del proyecto era crear un perfil de usuario personalizado mediante el registro del pulso y compararlo con valores anteriores para asegurar que el vehículo no pudiera ser arrancado por terceros, brindando mayor control y protección ante posibles robos. El sistema incluía el diseño, la codificación y la conexión de componentes clave de la motocicleta, como el relay y los motores de arranque eléctrico. El objetivo era que solo el usuario registrado pudiera activar el vehículo. Sin embargo, durante el desarrollo se presentaron dificultades con el sensor de pulso cardíaco, ya que los resultados variaban mucho dependiendo del entorno y las condiciones del usuario, haciendo que el sistema fuera poco confiable para la vida real. Este problema concluyó en que, aunque el prototipo logró su funcionalidad básica, la aplicación práctica del pulso cardíaco como método de seguridad no fue viable debido a su inexactitud y falta de estabilidad en diversas situaciones.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
     "assets/imgObj/proto01.jpg",
     "assets/imgObj/proto02.jpg"]
  },
  "school04":
  {
    "title": "Idioma Ingles",
    "description": "Mis estudios de inglés comenzaron en 2010, cuando inicié desde el nivel básico B1. Gracias a mi interés en los videojuegos y mi afinidad por la música rock/metal, me resultó sencillo avanzar rápidamente. Además, estudié en Harmon Hall, una escuela adicional a mi formación universitaria, lo que reforzó mi aprendizaje del idioma. En 2012, obtuve mi primera certificación oficial, y en 2014, logré la segunda certificación requerida para finalizar mis estudios de preparatoria. Finalmente, en 2022, obtuve la certificación necesaria para acreditar las materias de mi carrera universitaria."
  },
  "stupidFriendly":
  {
    "title": "Becario de Ingeniería de Software",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/HTML5.svg",
     "assets/mySVGs/Microsoft SQL Server.svg",
     "assets/mySVGs/Bootstrap.svg",
     "assets/mySVGs/BitBucket.svg",
     "assets/mySVGs/Django.svg"],
    "techtack": ["Lenguajes y Frameworks: Python (TurboGears 2.0), JavaScript (jQuery 1.7), HTML, CSS", "Base de Datos: MySQL 5.5", "Herramientas: jQuery para el Front-End, MySQL Workbench, TurboGears para desarrollo Backend"],
    "dutiesTitle": "Responsabilidades:",
    "duties": ["Documentación de las páginas de inventario, distribución, y una plataforma externa de venta y distribución de boletos", "Colaboración en la creación y mantenimiento de APIs para la gestión de datos utilizando Python (TurboGears) y JavaScript (jQuery).", "Identificación y corrección de problemas relacionados con la fiabilidad del sistema."],
    "timeTitle": "Tiempo:",
    "time": "2014 July — 2016 Dec"
  },
  "Infotec":
  {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/NETcore.svg", "assets/mySVGs/Bootstrap.svg", "assets/mySVGs/GitHub.svg", "assets/mySVGs/HTML5.svg"],
    "techtack": ["Lenguajes y Frameworks: .NET Framework 4.7.x, .NET Core 2.x, JavaScript (ES6), Angular 6.", "Base de Datos: MySQL 5.7.", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017."],
    "descTitle": "Descripción:",
    "description": "Participé en el desarrollo de dos proyectos web enfocados en la administración de usuarios y la creación de citas, lo que contribuyó significativamente a la funcionalidad y el alcance de las aplicaciones.",
    "dutiesTitle": "Responsabilidades:",
    "duties": ["Implementación de eventos en el Front-End y seguimiento de la lógica de eventos hasta la base de datos.", "Resolución de problemas y mantenimiento del sistema, incluyendo la identificación y solución de errores.", "Comunicación continua con los usuarios iniciales para recolectar retroalimentación y definir nuevas funcionalidades junto con el equipo de QA."],
    "timeTitle": "Time:",
    "time": "2019 Feb — 2021 Sep"
  },
  "Semovi":
  {
    "title": "Ingeniero de Software",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/Bootstrap.svg", "assets/mySVGs/GitHub.svg", "assets/mySVGs/HTML5.svg"],
    "techtack": ["Lenguajes y Frameworks: Laravel, JavaScript (ES6)", "Base de Datos: MySQL 5.7.", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017."],
    "descTitle": "Descripción:",
    "description": "Durante mi experiencia en SEMOVI, fui contratado por un periodo de 3 meses para trabajar en un proyecto relacionado con la Secretaría de Relaciones Exteriores (SRE), dado que ambas instituciones utilizaban el mismo stack de tecnologías. Mi labor principal consistió en agilizar la resolución y limpieza de bugs en una página dedicada a la generación de citas. Utilicé herramientas como Postman para verificar la integridad de los datos y encontrar errores en el sistema, lo que permitió mejorar significativamente el funcionamiento de la plataforma y optimizar su rendimiento.",
    "timeTitle": "Time:",
    "time": "2019"
  },

  "FletesTransportes": {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologías utilizadas:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/Android.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/Bootstrap.svg",
      "assets/mySVGs/GitHub.svg",
      "assets/mySVGs/HTML5.svg"
    ],
    "techtack": ["Lenguajes y Frameworks: Kotlin 1.4, SQLite 3.35, Retrofit 2.9, .NET Core 3.1, .NET Core 2.x, JavaScript (ES6), Angular 6, Node Express 4", "Base de Datos: MySQL 5.7", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 y 2019"],
    "descTitle": "Descripción:",
    "description": "Participé activamente y lideré una variedad de proyectos en diferentes áreas de desarrollo y soluciones empresariales. Las contribuciones clave incluyen la creación de un kiosco virtual, una herramienta integral que permitía a los empleados acceder y consultar información como viajes, vacaciones y bonos. Además, lideré un proyecto Android destinado a simplificar la gestión de inventario de tractocamiones, proporcionando detalles sobre el estado de sus componentes, como asientos, llantas y otros elementos clave. También dirigí la creación de un programa de gestión de mercancías diseñado para limpiar y procesar datos de los clientes, asegurando que solo la información esencial para la facturación fuera mantenida. Además, desarrollé un panel web para el área de monitoreo, que ofrecía una visión detallada de los datos de viaje, incluyendo puntos de inicio y fin, rutas, botones de emergencia y paradas de motor, entre otras funciones críticas.",
    "dutiesTitle": "Responsabilidades:",
    "duties": [
        "Definir y establecer la arquitectura del proyecto de gestión de mercancías, asegurando un diseño escalable que cumpliera con los objetivos del negocio.",
        "Implementar técnicas avanzadas de limpieza y validación de datos, incluyendo el uso de expresiones regulares para garantizar la integridad de los datos.",
        "Desarrollar algoritmos utilizando aprendizaje automático para extraer información clave de conjuntos de datos complejos, como hojas de Excel con formatos variables.",
        "Optimizar la arquitectura del sistema utilizando tecnologías y protocolos establecidos (FTP) para facilitar el intercambio eficiente de datos entre áreas.",
        "Diseñar e implementar una versión web de la aplicación siguiendo principios SOLID utilizando .NET y Angular.",
        "Realizar mantenimiento continuo del sistema e identificar proactivamente errores, incluyendo la gestión de dependencias para asegurar la estabilidad del sistema.",
        "Definir la estructura del proyecto Android de inventario, integrar APIs usando Retrofit e implementar el almacenamiento de datos con SQLite.",
        "Gestionar hilos y concurrencia utilizando Kotlin Coroutines, optimizando el rendimiento y resolviendo cuellos de botella, asegurando la compatibilidad con actualizaciones de Android.",
        "Desarrollar y aplicar la lógica necesaria para la extracción de datos críticos para la gestión de flotas, monitoreando eventos como paradas no autorizadas y alertas de emergencia."
    ],
    "methodologiesTitle": "Metodologías:",
    "methodologies": [
        "Aplicación de metodologías ágiles (Scrum) en todos los proyectos, trabajando en sprints para implementar mejoras basadas en retroalimentación continua.",
        "Colaboración con equipos multifuncionales para asegurar una comunicación fluida y entregas de proyectos a tiempo."
    ],
    "achivementTitle": "Logros:",
    "achivemens": ["Mejoré el tiempo de respuesta del sistema en un 20%", "Reduje el tiempo de procesamiento de datos en un 15% mediante la optimización de algoritmos."],
    "timeTitle": "Tiempo:",
    "time": "Mayo 2021 — Julio 2024"
  },

  "FletesTransportes01": {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologías utilizadas:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/GitHub.svg"
    ],
    "techtack": ["Lenguajes y Frameworks: .NET Core 3.1", "Base de Datos: MySQL 5.7", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 y 2019"],
    "descTitle": "Descripción:",
    "description": "Dirigí la creación de un programa de gestión de mercancías diseñado para limpiar y procesar datos de los clientes, asegurando que solo la información esencial para la facturación fuera mantenida.",
    "dutiesTitle": "Responsabilidades:",
    "duties": [
        "Definir y establecer la arquitectura del proyecto de gestión de mercancías, asegurando un diseño escalable que cumpliera con los objetivos del negocio.",
        "Implementar técnicas avanzadas de limpieza y validación de datos, incluyendo el uso de expresiones regulares para garantizar la integridad de los datos.",
        "Desarrollar algoritmos utilizando aprendizaje automático para extraer información clave de conjuntos de datos complejos, como hojas de Excel con formatos variables."
    ],
    "methodologiesTitle": "Metodologías:",
    "methodologies": [
        "Aplicación de metodologías ágiles (Scrum) en todos los proyectos, trabajando en sprints para implementar mejoras basadas en retroalimentación continua.",
        "Colaboración con equipos multifuncionales para asegurar una comunicación fluida y entregas de proyectos a tiempo."
    ],
    "achivementTitle": "Logros:",
    "achivemens": ["Incremento en un 30% el volumen numero de mercancías procedentes de clientes mas pequeños."],
    "timeTitle": "Tiempo:",
    "time": "Mayo 2021 — Julio 2024"
  },

  "FletesTransportes02": {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologías utilizadas:",
    "tech": [
      "assets/mySVGs/JSON.svg",
      "assets/mySVGs/Microsoft SQL Server.svg",
      "assets/mySVGs/Android.svg",
      "assets/mySVGs/CSharp.svg",
      "assets/mySVGs/NETcore.svg",
      "assets/mySVGs/GitHub.svg"
    ],
    "techtack": ["Lenguajes y Frameworks: Kotlin 1.4, SQLite 3.35, Retrofit 2.9, .NET Core 3.1, .NET Core 2.x, JavaScript (ES6), Angular 6, Node Express 4", "Base de Datos: MySQL 5.7", "Herramientas: Visual Studio Code, Visual Studio, SQL Server Management Studio (SSMS) 2017 y 2019"],
    "descTitle": "Descripción:",
    "description": "Lideré un proyecto clave destinado a modernizar el sistema de almacenamiento y registro de tractocamiones, que previamente operaba con un programa de escritorio desarrollado en .NET. El objetivo fue crear una solución más eficiente, desarrollando una API en C# y una aplicación Android que permitiera el envío y recepción de datos en formato JSON, junto con fotos de los componentes de las unidades, como llantas, tanques de gas, espejos, entre otros. La actualización trajo consigo diversas ventajas, como la posibilidad de registrar automáticamente cualquier componente que requiriera reemplazo. Esta información se almacenaba en el perfil de la unidad, lo que permitía su análisis posterior para alertar a las áreas correspondientes sobre la necesidad de mantenimiento preventivo o correctivo, como el cambio de llantas o la programación de una parada técnica. El sistema también optimizó los costos operativos, ya que reemplazar tablets, con un costo de aproximadamente $500 USD, resultaba mucho más económico que mantener los equipos de uso rudo, cuyo valor ascendía a $4000 USD. Esta implementación no solo facilitó el mantenimiento de los tractocamiones, sino que también mejoró la eficiencia en la recolección y análisis de datos, agilizando el proceso al momento de llegar o salir de los patios.",
    "dutiesTitle": "Responsabilidades:",
    "duties": [
        "Definir la estructura del proyecto Android de inventario, integrar APIs usando Retrofit e implementar el almacenamiento de datos con SQLite.",
        "Gestionar hilos y concurrencia utilizando Kotlin Coroutines, optimizando el rendimiento y resolviendo cuellos de botella, asegurando la compatibilidad con actualizaciones de Android.",
        "Planificación y Arquitectura del Proyecto.",
        "Conexiones y Comunicación entre Sistemas.",
        "Base de Datos y Almacenamiento de Información.",
        "Creación de Tests y Conexión con APIs.",
        "Optimización del Sistema para el Usuario Final."
    ],
    "methodologiesTitle": "Metodologías:",
    "methodologies": [
        "Aplicación de metodologías ágiles (Scrum) en todos los proyectos, trabajando en sprints para implementar mejoras basadas en retroalimentación continua.",
        "Colaboración con equipos multifuncionales para asegurar una comunicación fluida y entregas de proyectos a tiempo."
    ],
    "achivementTitle": "Logros:",
    "achivemens": ["El sistema también optimizó los costos operativos, ya que reemplazar tablets, con un costo de aproximadamente $500 USD, resultaba mucho más económico que mantener los equipos de uso rudo, cuyo valor ascendía a $4000 USD. Esta implementación no solo facilitó el mantenimiento de los tractocamiones, sino que también mejoró la eficiencia en la recolección y análisis de datos, agilizando el proceso al momento de llegar o salir de los patios."],
    "timeTitle": "Tiempo:",
    "time": "Mayo 2021 — Julio 2024"
  },

  "FletesTransportes03": {
    "title": "Ingeniero de Software Junior",
    "techTitle": "Tecnologías utilizadas:",
    "tech": [
      "assets/mySVGs/Microsoft SQL Server.svg"
    ],
    "techtack": ["Base de Datos: MySQL 5.7", "Herramientas: SQL Server Management Studio (SSMS) 2017 y 2019"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un panel web para el área de monitoreo, que ofrecía una visión detallada de los datos de viaje, incluyendo puntos de inicio y fin, rutas, botones de emergencia y paradas de motor, entre otras funciones críticas.",
    "dutiesTitle": "Responsabilidades:",
    "duties": [
      "Creé y optimicé consultas SQL complejas para extraer datos en tiempo real sobre el posicionamiento de las unidades, su ruta actual y su historial de trayectos.",
      "Apliqué técnicas de optimización como índices y partición de tablas para asegurar que las consultas de gran escala se ejecutaran de manera eficiente, incluso con un volumen elevado de datos.",
      "Realizar mantenimiento continuo del sistema e identificar proactivamente errores, incluyendo la gestión de dependencias para asegurar la estabilidad del sistema.",
      "Desarrollar y aplicar la lógica necesaria para la extracción de datos críticos para la gestión de flotas, monitoreando eventos como paradas no autorizadas y alertas de emergencia."
    ],
    "methodologiesTitle": "Metodologías:",
    "methodologies": [
        "Aplicación de metodologías ágiles (Scrum) en todos los proyectos, trabajando en sprints para implementar mejoras basadas en retroalimentación continua.",
        "Colaboración con equipos multifuncionales para asegurar una comunicación fluida y entregas de proyectos a tiempo."
    ],
    "timeTitle": "Tiempo:",
    "time": "Mayo 2021 — Julio 2024"
  },

  "pp01":
  {
    "title": "Bici-moto 2 tiempos",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
     "assets/imgObj/weld01.jpg",
     "assets/imgObj/bici01.jpg",
     "assets/imgObj/bici02.jpg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé una bici-moto desde la modificación del cuadro original de la bicicleta para integrar un motor de combustión de 2 tiempos. Implementé componentes electrónicos como el CDI y un sistema de encendido biométrico con Arduino. Utilicé dos sensores, uno de pulso cardíaco y un lector de huella digital, para asegurar que solo el usuario autorizado pudiera encender el motor, integrando el sistema con los componentes de arranque de la moto."
  },
  "pp02":
  {
    "title": "Bici-moto 4 tiempos",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Arduino.svg"],
    "images": [
     "assets/imgObj/weld01.jpg",
     "assets/imgObj/bici03.jpg"],
    "descTitle": "Descripción:",
    "description": "Actualicé el proyecto reemplazando el motor de 2 tiempos por uno de 4 tiempos, lo que mejoró la eficiencia y el rendimiento del vehículo. Este cambio incluyó ajustes en el sistema de encendido biométrico, manteniendo el uso del sensor de huella digital, pero optimizando el control del motor para aprovechar las características del nuevo motor."
  },
  "pp03":
  {
    "title": "Tinder automatico con Selenium",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Selenium.svg", "assets/mySVGs/CSharp.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un proyecto en C# utilizando Selenium para automatizar la interacción en una plataforma de redes sociales. Este sistema puede iniciar sesión, dar likes, navegar entre fotos, leer descripciones, recopilar datos de preferencias o intereses para iniciar conversaciones, dar dislikes, e iniciar conversaciones de forma automática. Sin embargo, una limitante clave es que no puede comprender ni responder de manera autónoma a conversaciones emergentes o personalizadas, lo que restringe la interacción a procesos básicos automatizados."
  },
  "pp04":
  {
    "title": "Mascara en Raspberry Pi",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un proyecto utilizando una Raspberry Pi programada en Python con OpenCV para detectar y procesar movimientos oculares con una cámara. Los movimientos del ojo (izquierda, derecha, arriba, abajo, y parpadeos) eran enviados a un Arduino que controlaba un módulo LED (MAX7219), simulando los movimientos en una matriz de LEDs. También implementé un micrófono para reconocer el tono de voz y codificarlo en una matriz de 8x128 LEDs. Creé las placas para soportar el módulo y expandir la matriz hasta 32x128 LEDs, todo integrado con control preciso del movimiento ocular."
  },
  "pp05":
  {
    "title": "Torreta en Raspberry Pi",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé una torreta automática utilizando una Raspberry Pi, servomotores y Python con OpenCV para seguir códigos QR. El sistema utilizaba una cámara para detectar el código QR y procesar la imagen, ajustando los servomotores para apuntar con precisión hacia el código. Una vez alineado, se activaba un láser que señalaba directamente el código QR. Además, implementé un contador de disparos positivos, que llevaba el registro de las veces que el sistema lograba apuntar correctamente al objetivo."
  },
  "pp06":
  {
    "title": "Camara de seguridad en Raspberry Pi",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/RaspberryPi.svg", "assets/mySVGs/Arduino.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un sistema de seguridad utilizando una Raspberry Pi con una cámara y Python junto con OpenCV para el seguimiento de códigos QR. El proyecto inicial consistía en detectar movimientos y activar una alarma en caso de actividad sospechosa, funcionando como un sistema de seguridad básica. Esta propuesta tiene el potencial de escalar, añadiendo detección avanzada de objetos peligrosos como cuchillos, armas u otros, utilizando algoritmos de reconocimiento de objetos en tiempo real. De este modo, se mejoraría la precisión y capacidad del sistema para reaccionar ante situaciones de riesgo."
  },
  "pp07":
  {
    "title": "Juego para celular",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/CSharp.svg", "assets/mySVGs/Unity.svg", "assets/mySVGs/JSON.svg"],
    "descTitle": "Descripción:",
    "description": "Desarrollé un juego para celular tipo runner en Unity utilizando C#. El juego incluye cuatro niveles con una dificultad progresiva, en los que cambian la velocidad de los enemigos y los obstáculos en cada mapa. Los assets fueron creados en Blender, y el juego cuenta con una integración a través de una API en C# para guardar y consultar los puntajes en una base de datos en SQL. El juego fue publicado en la Play Store de Android, aunque posteriormente fue retirado de la plataforma."
  },
  "curso01":
  {
    "title": "ANGULAR and ASP.NET Core REST API - Real World Application.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/CSharp.svg", "assets/mySVGs/Angular.svg", "assets/mySVGs/JSON.svg"],
    "techtack": ["Instructor: Sameer Saini"],
    "dutiesTitle": "Temas:",
    "duties": ["Angular CLI", "Angular Components", "Angular Routing", "Angular Services", "HTTP calls", "CORS", "Use Bootstrap CSS in Angular applications", "Create reusable components", "CRUD operations (Create Read Update Delete)", "Angular Forms", "Live Markdown Preview", "Markdown to HTML", "Angular Form Elements", "Authentication and Authorization", "JWT Tokens and Storage", "Cookie Services", "Local Storage", "Interceptors", "Auth/Route Guards", "Image Upload in Angular applications", "Models and Interfaces", "Create ASPNET Core APIs from scratch using C#", "Create endpoints and action methods", "CRUD operations in ASP.NET Core (Create Read Update Delete)", "Install and Use Entity Framework Core to connect to SQL Server database", "Understand and implement Entity framework core relationships", "Domain-Driven Design Patterns (DDD)", "Repository Pattern in ASP.NET Core", "Domain Modelling", "Entity Framework Code First Approach", "SQL Server", "Seeding the Database", "HTTP Web Methods", "Authentication and Authorization", "JWT Tokens", "Role Based Authorization", "Image Upload in ASP.NET Core Web API", "Write Clean, Re-Usable Code"]
  },
  "curso02":
  {
    "title": "Node: De cero a experto.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/node01.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/GitHub.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": ["SocketIO", "JWT", "Git", "GitHub", "JSON", "Google Services", "Google APIs", "Heroku", "MySQL", "TypeScript", "PostMan", "Express", "YARGS", "Aplicaciones de consola básicas e interactivas", "Mongo Compass", "Paquetes", "NPM", "RESTServer", "Socket Server", "Consumo de servicios", "Creación de archivos", "Despliegues"]
  },
  "curso03":
  {
    "title": "JavaScript Moderno: Guía para dominar el lenguaje.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/GitHub.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": ["Bases de JavaScript", "Tipos de datos", "Objetos", "Operadores", "Ciclos", "ESNext", "Clases", "Propiedades privadas", "Node", "Npm", "Instalación de paquetes en proyectos de JavaScript", "Promesas", "Callbacks", "CRUD", "Modals manuales", "Carga de archivos", "Fetch", "Funciones generadoras", "Vite", "Mappers", "JSDocs y documentación de funciones", "VSCode con tipos de datos en JavaScript", "Manipulación del DOM"]
  },
  "curso04":
  {
    "title": "Angular: De cero a experto.",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/Angular.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": ["Bases de TypeScript y ESCMAScript", "Hola Mundo en Angular", "Componentes", "Directivas", "Servicios", "Módulos", "Todos los pipes de Angular", "Rutas", "Rutas Hijas", "Carga perezosa o Lazyload de módulos", "Guards", "Protección de rutas", "Autenticación mediante JsonWebTokens", "Mapas", "Uso de librerías de terceros escritas en Angular", "Uso de librerías NO escritas para Angular", "Consumo de APIs", "CRUD", "SPA", "Git", "GitHub", "Despliegues a producción", "MongoDB", "Node", "Re-utilización de componentes, directivas, servicios..", "Comunicación entre componentes y módulos", "Uso de extensiones reactivas", "PrimeNG", "Material Design", "Bootstrap", "Tailwind", "Defer", "Triggers", "Signals", "Writable Signals", "Computed Signals"]
  },
  "curso05":
  {
    "title": "Principios SOLID y Clean Code",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/JavaScript.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/TypeScript.svg"],
    "techtack": ["Instructor: Fernando Herrera"],
    "dutiesTitle": "Temas:",
    "duties": ["S – Single Responsibility Principle (SRP)", "O – Open/Closed Principle (OCP)", "L – Liskov Substitution Principle (LSP)", "I – Interface Segregation Principle (ISP)", "D – Dependency Inversion Principle (DIP)"]
  },
  "curso06":
  {
    "title": "Curso completo programación C# en .Net ",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/CSharp.svg", "assets/mySVGs/JSON.svg", "assets/mySVGs/NETcore.svg"],
    "techtack": ["Instructor: Alberto Picazo"],
    "dutiesTitle": "Temas:",
    "duties": ["Inicialización a SQL Server", "Iniciación a Entity Framework Core", "Clean Code", "Iniciación a Azure", "Principios SOLID", "Principios API REST", "Conceptos de Inyección Dependencias en .Net Core", "Creación de API de .Net Core desde cero", "OpenApi / Swagger en proyectos de API de .Net Core", "HttpClientFactory en Net Core 2.1+"]
  },
  "curso07":
  {
    "title": "Docker, de principiante a experto",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Docker.svg"],
    "techtack": ["Instructor: Ricardo Andre Gonzalez Gomez"],
    "dutiesTitle": "Temas:",
    "duties": ["Imágenes", "Contenedores", "Volúmenes", "Redes", "Docker Compose", "Docker Registry"]
  },
  "curso08":
  {
    "title": "Android Retrofit 2 complete course in Kotlin",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/Android.svg"],
    "techtack": ["Instructor: Catalin Stefan"],
    "dutiesTitle": "Temas:",
    "duties": ["Basic Retrofit implementation", "Logging", "URL resolution", "GET, POST and other request methods", "Queries", "URL manipulation", "Request body", "Sending form data", "Headers", "Canceling requests", "Caching", "Pagination", "Synchronous vs asynchronous communications", "Retrofit with RxJava", "Authentication"]
  },
  "curso09":
  {
    "title": "Programación de Aplicaciones para Android con Kotlin",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/JSON.svg", "assets/mySVGs/Android.svg"],
    "techtack": ["Instructor: Jose Javier Villena"],
    "dutiesTitle": "Temas:",
    "duties": ["Lenguaje Kotlin de cero a avanzado (POO)", "Uso profesional de Android Studio (atajos de teclado, depuración, etc)", "Metodología de trabajo (no hagas apps sin cabeza, te ayudaré a saber trazar una hora de ruta de desarrollo)", "Sistema de Pagos", "Inserción de Publicidad", "Registro legal de la APP", "Maps y geolocalizazión GPS", "Control de los recursos del dispositivo (camara, audio, memoria, etc)", "Base de Datos FIrestore Firebase", "Almacenamiento en la nube Firebase Storage", "Integración de librerías y recursos de terceros", "Notificaciones", "SharedPreferences", "Widgets"]
  },
  "curso10":
  {
    "title": "Complete Microsoft SQL Server Database Administration Course",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Microsoft SQL Server.svg"],
    "techtack": ["Instructor: Imran Afzal"],
    "dutiesTitle": "Temas:",
    "duties": ["DML Statement with examples", "DDL Statements with examples", "DCL Statement with examples", "TCL Statement with examples", "Create TABLE(s) and Temp Table(s)", "What Is a View?", "SELECT Statement in detail", "Operators, Expressions and Conditions", "WHERE Clause, ORDER BY, HAVING BY, GROUP BY Clause", "Select from two tables – JOINS", "Different Types of JOINS", "What is a Sub Query?", "INSERT, UPDATE, DELETE and Truncate Statements", "What is a Store Procedure?", "Function, Trigger and INDEX", "Clustered ,Non-clustered Indexes and Index Design considerations", "Index Fragmentation and Lab for Index", "Overview of MSSQL Management Tools", "Exploring SQL Server Management Studio (SSMS)", "Exploring SQL Server Configuration Manager", "MSSQL System Databases, DO's and DONT's of System databases", "What is master, etmpdb, msdb and other system databases?", "What are Pages , Extents, Page Architecture and PFS?", "MSSQL Architecture", "MSSQL Database Architecture", "Operation and working of transaction log", "Configuring user Database", "Best practices while creating user Database"]
  },
  "curso11":
  {
    "title": "Blender 2.9x Modelado 3D para Videojuegos FLUJO COMPLETO",
    "techTitle": "Tecnologias utilizadas:",
    "tech": ["assets/mySVGs/Blender.svg"],
    "techtack": ["Instructor: Mariano Rivas"],
    "dutiesTitle": "Temas:",
    "duties": ["Análisis de referencias: Estudiar y analizar imágenes de referencia para comprender la estructura del tanque.", "Blocking de volumen: Crear formas básicas que representen el volumen general del tanque antes de agregar detalles.", "Modelado detallado: Modelar los accesorios y detalles finales del tanque.", "Limpieza de geometría: Optimizar la geometría para mejorar el rendimiento del modelo en motores de videojuegos.", "Reducción de polígonos: Disminuir la cantidad de polígonos sin sacrificar detalles esenciales para un mejor rendimiento.", "Mapeado UV: Crear y aplicar coordenadas UV para las partes modeladas del tanque.", "Optimización de texturas UV: Organizar la geometría en una textura optimizada para el uso eficiente de recursos.", "Pintura 2D y 3D en Blender: Crear texturas y colores base utilizando herramientas integradas de Blender.", "Generación de mapas de oclusión: Generar y aplicar mapas de oclusión para mejorar el sombreado en el modelo.", "Técnicas de pintura manual: Pintar manualmente sobre el modelo utilizando diferentes herramientas de Blender.", "Pintura con texturas STENCIL: Aplicar texturas mediante la técnica STENCIL.", "Uso de nodos en el Shader Graph: Profundizar en el uso de nodos para crear materiales en Blender.", "Preparación para exportar a Unity: Exportar el modelo y las texturas desde Blender para integrarlas en Unity.", "Generación de texturas para flujos de trabajo en motores de videojuegos: Crear texturas específicas para renderizado en tiempo real o con luz almacenada en Unity."]
  },
  "curso12": {
    "title": "Three.js and TypeScript",
    "techTitle": "Tecnologías utilizadas:",
    "tech": ["assets/mySVGs/NPM.svg", "assets/mySVGs/TypeScript.svg", "assets/mySVGs/Three.js.svg"],
    "techtack": ["Instructor: Sean Bradley"],
    "dutiesTitle": "Temas:",
    "duties": [
      "Crear un proyecto Three.js utilizando NPM y package.json",
      "Aprender sobre el empaquetador Vite y el uso de módulos ES6 en el cliente del navegador",
      "Crear (o instalar opcionalmente) una plantilla base en TypeScript para proyectos con Three.js",
      "Entender la escena, cámara y renderizador en Three.js",
      "Aprender sobre el ciclo de animación",
      "Uso de paneles como Stats, Dat GUI y lil-gui",
      "Trabajar con la clase Object3D y las propiedades de rotación, posición, escala, visibilidad y matrices",
      "Uso de geometrías como Caja, Esfera, Icosaedro, Plano, TorusKnot y más",
      "Materiales básicos, normales, Phong, Standard, Physical y otros",
      "Introducción a PBR, rugosidad y metalicidad",
      "Iluminación con luces Ambientales, Direccionales, Puntuales y Spot",
      "Uso de sombras con cámaras de sombra en perspectiva y ortográficas",
      "Controles de interacción con el ratón y el tacto: Orbit, Trackball y Pointerlock",
      "Cargar modelos con loaders como GLTF, DRACO, OBJ, Texturas, RGBE y otros",
      "Importar animaciones de terceros en formatos glTF/glB",
      "Animar utilizando Lerp, JEasings y Animation Mixer",
      "Uso de Raycaster para la selección de objetos 3D con el ratón",
      "Física con Rapier",
      "Depuración de física con Rapier Debug Renderer",
      "Comprensión de formas para la detección de colisiones",
      "Provisión, despliegue y puesta en marcha de proyectos Three.js en un servidor de producción",
      "Ajuste de la iluminación y mapas de entorno para coincidir con Blender"
    ]
  },



  "SRE":
  {
    "title": "Des Sr",
    "tech": ["assets/mySVGs/wrench01.svg", "assets/mySVGs/cubes01.svg"],
    "techtack": ["dotNet 5.0", "node express 3.8"],
    "description": " lorem ipsum dolor sit amet",
    "achivement": "llorem ipsum dolor sit amet"
  }
}
